#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/maxfrise/maxfrise-infra/runs/run-BccwTry48WUunFMJ

Waiting for the plan to start...

Terraform v1.4.2
on linux_amd64
Initializing plugins and modules...
module.agencies_lambda.data.archive_file.agencies_source: Refreshing...
module.agencies_lambda.data.archive_file.agencies_source: Refresh complete after 0s [id=b8507df8cc058be70af7741e56ac27945780bf60]
module.maxfrise_api_gateway.aws_api_gateway_integration_response.agencies_lambda_integration_response: Refreshing state... [id=agir-8hbmj9nmrj-udh18b-POST-200]
module.maxfrise_api_gateway.aws_api_gateway_method_response.agencies_resource_method_response: Refreshing state... [id=agmr-8hbmj9nmrj-udh18b-POST-200]
module.maxfrise_api_gateway.aws_api_gateway_rest_api.maxfrise_api: Refreshing state... [id=8hbmj9nmrj]
module.iam_maxfrise_lambdas.aws_iam_role.iam_maxfrise_lambdas: Refreshing state... [id=iam_maxfrise_lambdas]
module.agencies_lambda.aws_s3_object.agencies_s3_bucket: Refreshing state... [id=agencies_lambda.zip]
module.dynamoDB_agencies_prod_table.aws_dynamodb_table.agencies_prod: Refreshing state... [id=agencies-prod-table]
module.dynamoDB_agencies_test_table.aws_dynamodb_table.agencies_test: Refreshing state... [id=agencies-test-table]
module.maxfrise_api_gateway.aws_api_gateway_resource.agencies_resource: Refreshing state... [id=udh18b]
module.agencies_lambda.aws_lambda_function.agencies_lambda: Refreshing state... [id=agencies_lambda]
module.maxfrise_api_gateway.aws_api_gateway_method.agencies_resource_method: Refreshing state... [id=agm-8hbmj9nmrj-udh18b-POST]
module.maxfrise_api_gateway.aws_lambda_permission.agencies_api_lambda_permission: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.maxfrise_api_gateway.aws_api_gateway_integration.agencies_lambda_integration_request: Refreshing state... [id=agi-8hbmj9nmrj-udh18b-POST]
module.maxfrise_api_gateway.aws_api_gateway_deployment.api_test_deployment: Refreshing state... [id=8e5u9a]
module.maxfrise_api_gateway.aws_api_gateway_deployment.api_prod_deployment: Refreshing state... [id=bqf6wg]
module.maxfrise_api_gateway.aws_api_gateway_stage.test: Refreshing state... [id=ags-8hbmj9nmrj-test]
module.maxfrise_api_gateway.aws_api_gateway_stage.prod: Refreshing state... [id=ags-8hbmj9nmrj-prod]
module.maxfrise_api_gateway.aws_api_gateway_method_response.agencies_resource_method_response: Drift detected (update)
module.maxfrise_api_gateway.aws_api_gateway_integration_response.agencies_lambda_integration_response: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.maxfrise_api_gateway.aws_api_gateway_deployment.api_prod_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "api_prod_deployment" {
      ~ created_date  = "2023-06-28T05:30:05Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-west-2:914036813947:8hbmj9nmrj/" -> (known after apply)
      ~ id            = "bqf6wg" -> (known after apply)
      ~ invoke_url    = "https://8hbmj9nmrj.execute-api.us-west-2.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          - "redeployment" = "780e7ad7af14109f525c6f234cffe3b09eeb3177"
        } -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.maxfrise_api_gateway.aws_api_gateway_deployment.api_test_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "api_test_deployment" {
      ~ created_date  = "2023-06-28T05:30:05Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-west-2:914036813947:8hbmj9nmrj/" -> (known after apply)
      ~ id            = "8e5u9a" -> (known after apply)
      ~ invoke_url    = "https://8hbmj9nmrj.execute-api.us-west-2.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          - "redeployment" = "780e7ad7af14109f525c6f234cffe3b09eeb3177"
        } -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.maxfrise_api_gateway.aws_api_gateway_integration.agencies_lambda_integration_request must be replaced
+/- resource "aws_api_gateway_integration" "agencies_lambda_integration_request" {
      - cache_key_parameters    = [] -> null
      ~ cache_namespace         = "udh18b" -> (known after apply)
      ~ id                      = "agi-8hbmj9nmrj-udh18b-POST" -> (known after apply)
      ~ passthrough_behavior    = "WHEN_NO_MATCH" -> (known after apply)
      - request_parameters      = {} -> null
      - request_templates       = {
          - "application/json" = <<-EOT
                {
                  "body" : $input.json('$'),
                  "environment": "$stageVariables.environment"
                }
            EOT
        } -> null
      ~ type                    = "AWS" -> "AWS_PROXY" # forces replacement
        # (7 unchanged attributes hidden)
    }

  # module.maxfrise_api_gateway.aws_api_gateway_integration_response.agencies_lambda_integration_response will be destroyed
  # (because aws_api_gateway_integration_response.agencies_lambda_integration_response is not in configuration)
  - resource "aws_api_gateway_integration_response" "agencies_lambda_integration_response" {
      - http_method         = "POST" -> null
      - id                  = "agir-8hbmj9nmrj-udh18b-POST-200" -> null
      - resource_id         = "udh18b" -> null
      - response_parameters = {} -> null
      - response_templates  = {} -> null
      - rest_api_id         = "8hbmj9nmrj" -> null
      - status_code         = "200" -> null
    }

  # module.maxfrise_api_gateway.aws_api_gateway_method_response.agencies_resource_method_response will be destroyed
  # (because aws_api_gateway_method_response.agencies_resource_method_response is not in configuration)
  - resource "aws_api_gateway_method_response" "agencies_resource_method_response" {
      - http_method         = "POST" -> null
      - id                  = "agmr-8hbmj9nmrj-udh18b-POST-200" -> null
      - resource_id         = "udh18b" -> null
      - response_models     = {} -> null
      - response_parameters = {} -> null
      - rest_api_id         = "8hbmj9nmrj" -> null
      - status_code         = "200" -> null
    }

  # module.maxfrise_api_gateway.aws_api_gateway_stage.prod will be updated in-place
  ~ resource "aws_api_gateway_stage" "prod" {
      ~ deployment_id         = "bqf6wg" -> (known after apply)
        id                    = "ags-8hbmj9nmrj-prod"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # module.maxfrise_api_gateway.aws_api_gateway_stage.test will be updated in-place
  ~ resource "aws_api_gateway_stage" "test" {
      ~ deployment_id         = "8e5u9a" -> (known after apply)
        id                    = "ags-8hbmj9nmrj-test"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

Plan: 3 to add, 2 to change, 5 to destroy.

```

</details>

*Pushed by: @inavac182, Action: `pull_request`*